#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Sun Oct 20 16:46:43 2024

add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/top5.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/key_filter.v"
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/PLL/PLL.idf
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/ms72xx_ctl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/ms7200_ctl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/ms7210_ctl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/iic_dri.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/adc_dac_top.v"
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/ad_clock_125m/ad_clock_125m.idf
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/hdmi_loop_revised.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/image_bright_adjust.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/image_contrast_adjust.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/image_relief_effect.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/image_saturation_adjust.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/image_rgb2gray.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_rec_top.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/gmii_to_rgmii.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/crc32_d8.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_rx.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_tx.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/asyn_fifo.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/cordic_jpl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/cordic_newton.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/data_module_fft.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/fft_ctrl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/fft_top.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/fft_demo_00.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/distram_sdpram/ipsxe_fft_distram_sdpram.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/distram_sreg/rtl/ipsxe_fft_distributed_sdpram_v1_2.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/distram_sreg/rtl/ipsxe_fft_distributed_shiftregister_v1_3.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/distram_sreg/ipsxe_fft_distram_sreg.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/drm_sdpram/rtl/drm_init_param.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/drm_sdpram/rtl/ipml_sdpram_v1_7_drm.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_18k.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/drm_sdpram/ipsxe_fft_drm_sdpram_36k.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/fft_top/logos_fft_demo/rtl/synplify/ipsxe_fft_core_v1_1_vpAll.vp"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/hdmi_top/dpram.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/hdmi_top/hdmi_test1.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/hdmi_top/pattern_vg_revised.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/hdmi_top/sync_vg_revised1.v"
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/ram2/ram2.idf
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/sync_generator.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/uart_rx.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/video_zoom.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/axi_m.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/axi_m_arbitration.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/rw_fifo_ctrl.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/eth_adnet_pkt.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/eth_img_pkt.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_tx_top_revised.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_top.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_rx_image.v"
add_design "C:/Users/86151/Desktop/competition_new/competition_file/src/UDP_test/udp_tx_image.v"
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/interpolation_ram/interpolation_ram.idf
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/write_ddr_fifo/write_ddr_fifo.idf
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/read_ddr_fifo/read_ddr_fifo.idf
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/fifo_data_pkt/fifo_data_pkt.idf
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/eth_pkt_fifo/eth_pkt_fifo.idf
add_design C:/Users/86151/Desktop/competition_new/competition_file/prj5/ipcore/ddr_test/ddr_test.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "C:/Users/86151/Desktop/competition_new/competition_file/prj5/source/fdc/top5.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top5
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
